# Agenda, week 2

1. Q&A
2. Data frames
    - Creating them
    - Indexes and column names
    - Retrieving from them
    - Methods and attributes that we'll want to use
    - `.loc` and mask indexes
3. Creating data frames from files
    - CSV
    - Other formats, as well
    - Retrieving data from the Internet

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
s = Series([10, 20, 30, np.nan, 50, 60, 70, np.nan, np.nan, 100, 200],
          index=list('abcdefghijk'))
s

a     10.0
b     20.0
c     30.0
d      NaN
e     50.0
f     60.0
g     70.0
h      NaN
i      NaN
j    100.0
k    200.0
dtype: float64

In [6]:
s.dropna()    # this method removes the NaN values from a series, and returns the new series without NaN -- the original is unchanged

a     10.0
b     20.0
c     30.0
e     50.0
f     60.0
g     70.0
j    100.0
k    200.0
dtype: float64

In [7]:
s  # how can it be that we still have NaN values here??

a     10.0
b     20.0
c     30.0
d      NaN
e     50.0
f     60.0
g     70.0
h      NaN
i      NaN
j    100.0
k    200.0
dtype: float64

In [8]:
# how can you actually remove NaN values from a series?

# s = s.dropna()   # this returns the new series that dropna returned, and assigns it back to s, replacing the original one

In [9]:
s.fillna(999)   # new series with 999 instead of NaN is returned, but the original (s) is still unchanged

a     10.0
b     20.0
c     30.0
d    999.0
e     50.0
f     60.0
g     70.0
h    999.0
i    999.0
j    100.0
k    200.0
dtype: float64

In [10]:
s.interpolate()  # returns a new series, but doesn't change the original

a     10.0
b     20.0
c     30.0
d     40.0
e     50.0
f     60.0
g     70.0
h     80.0
i     90.0
j    100.0
k    200.0
dtype: float64

By having methods return a new series/data frame, rather than modify the original, you can "chain" methods and perform longer, more interesting queries without making any assignments.

# Data frames

If a series is a 1D data structure, with an index and values (all of which are one dtype), then a data frame is a 2D data structure, similar to an Excel spreadsheet.

A data frame:

- Has an index, which refers to the rows
- Has column names, which refer to the columns
- Each column is a series! This means that each column has a dtype. You can have different dtypes in different columns, but all of the values in a single column must be the same.

In [11]:
# creating a data frame

# I'll create this using a list of lists


df = DataFrame([[10, 20, 30],
                [40, 50, 60],
                [70, 80, 90],
                [100, 110, 120]])
df

     0    1    2
0   10   20   30
1   40   50   60
2   70   80   90
3  100  110  120

We can see in our data frame:

- The index goes from 0-3, along the left side, just as we saw with a series
- The column names goes from 0-2, along the top, naming the columns

In [12]:
# Can I work with this data frame? Yes. But it's usually better to give names to our index and our columns.
# we can do that at creation time by passing the "index" and "columns" keyword arguments.

df = DataFrame([[10, 20, 30],
                [40, 50, 60],
                [70, 80, 90],
                [100, 110, 120]],
              index=list('abcd'),
              columns=list('xyz'))

df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [13]:
# I can get the index for df with df.index

df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [14]:
# I can get the columns for df with df.columns

df.columns

Index(['x', 'y', 'z'], dtype='object')

# To retrieve a row, we can use either `.loc` or `.iloc` -- just like with a series

In [15]:
df.loc['a']  # get row 'a'

x    10
y    20
z    30
Name: a, dtype: int64

In [16]:
df.loc['c']

x    70
y    80
z    90
Name: c, dtype: int64

In [17]:
# fancy indexing!

df.loc[['a', 'c']]   # 2 rows means... a data frame!

    x   y   z
a  10  20  30
c  70  80  90

In [19]:
df.loc['b':'d']  # .loc + a slice give us "up to and including"

     x    y    z
b   40   50   60
c   70   80   90
d  100  110  120

In [20]:
df.iloc[0]   # row in position 0

x    10
y    20
z    30
Name: a, dtype: int64

In [21]:
df.iloc[2]  # row in position 2

x    70
y    80
z    90
Name: c, dtype: int64

In [23]:
df.iloc[[0, 2]]   # fancy indexing with iloc

    x   y   z
a  10  20  30
c  70  80  90

# Note: If you want to retrieve columns, use just `[]`

- To retrieve rows based on the index/position, use `loc` and `iloc`
- To retrieve columns, use just `[]`

In [24]:
df['x']

a     10
b     40
c     70
d    100
Name: x, dtype: int64

In [25]:
df['z']

a     30
b     60
c     90
d    120
Name: z, dtype: int64

In [26]:
df['x':'z']  # sadly, this syntax is understood by Pandas to mean: Use the rows!

Empty DataFrame
Columns: [x, y, z]
Index: []

In [28]:
df[['x', 'z']]  # fancy indexing on the columns!

     x    z
a   10   30
b   40   60
c   70   90
d  100  120

# Exercise: Grocery store

1. Create a data frame describing products in a grocery store. The columns will be `product`, `price`, `department`. You should have 5 total products.  Each product will be a new row in the data frame. The index should be the numeric ID for that product. Each product's ID is a 3-digit number.
2. Retrieve the products as positions 0 and 3. Then, using their product IDs, using `.loc` to retrieve the same products.
3. Retrieve just the `price` column. What is the mean price of items in your store?

In [31]:
df = DataFrame([  ['apple', 10, 'produce'],
                  ['banana', 5, 'produce'],
                  ['computer', 1000, 'electronics'],
                  ['doorstop', 2, 'hardware'],
                  ['enchiladas', 5, 'food']  ],
              index=[101, 102, 201, 301, 401],
              columns=['product', 'price', 'department'])
df

        product  price   department
101       apple     10      produce
102      banana      5      produce
201    computer   1000  electronics
301    doorstop      2     hardware
401  enchiladas      5         food

In [32]:
df = DataFrame([  ['apple', 10, 'produce'],
                  ['banana', 5, 'produce'],
                  ['computer', 1000, 'electronics'],
                  ['doorstop', 2, 'hardware'],
                  ['enchiladas', 5, 'food']  ],
              index=list('abcde'),   # what is this?
              columns=['product', 'price', 'department'])
df

      product  price   department
a       apple     10      produce
b      banana      5      produce
c    computer   1000  electronics
d    doorstop      2     hardware
e  enchiladas      5         food

In [33]:
# index must get a list
# if I run list() on an iterable, I get a list back whose elements are the values from the iterable

list('abcde') # this runs a for loop on the string, and each iteration's value is a list element

['a', 'b', 'c', 'd', 'e']

In [34]:
df = DataFrame([  ['apple', 10, 'produce'],
                  ['banana', 5, 'produce'],
                  ['computer', 1000, 'electronics'],
                  ['doorstop', 2, 'hardware'],
                  ['enchiladas', 5, 'food']  ],
              index=[101, 102, 201, 301, 401],
              columns='product price department'.split())
df

        product  price   department
101       apple     10      produce
102      banana      5      produce
201    computer   1000  electronics
301    doorstop      2     hardware
401  enchiladas      5         food

In [35]:
# Retrieve the products as positions 0 and 3. Then, using their product IDs, using .loc to retrieve the same products.

df.iloc[[0, 3]]

      product  price department
101     apple     10    produce
301  doorstop      2   hardware

In [36]:
df.loc[[101, 301]]

      product  price department
101     apple     10    produce
301  doorstop      2   hardware

In [38]:
# Retrieve just the price column. What is the mean price of items in your store?

df['price'].mean()

np.float64(204.4)

In [39]:
# How can I add a new column to my data frame?
# Answer: assign to it

df

        product  price   department
101       apple     10      produce
102      banana      5      produce
201    computer   1000  electronics
301    doorstop      2     hardware
401  enchiladas      5         food

In [40]:
# if you assign to a column, and the column didn't previously exist, you have added it!

df['tax'] = [1,2,3,4,5]
df

        product  price   department  tax
101       apple     10      produce    1
102      banana      5      produce    2
201    computer   1000  electronics    3
301    doorstop      2     hardware    4
401  enchiladas      5         food    5

In [41]:
# if you assign to a column, and the column *DID* previously exist, you have replaced the existing one.

df['tax'] = [10, 20, 30, 40, 50]
df

        product  price   department  tax
101       apple     10      produce   10
102      banana      5      produce   20
201    computer   1000  electronics   30
301    doorstop      2     hardware   40
401  enchiladas      5         food   50

In [42]:
# You can use all of the tools we've seen so far to calculate and create new series
# for example, let's assume that the tax on each good is 10%. Create a new tax column
# that reflects this.

df['tax'] = df['price'] * 0.1
df

        product  price   department    tax
101       apple     10      produce    1.0
102      banana      5      produce    0.5
201    computer   1000  electronics  100.0
301    doorstop      2     hardware    0.2
401  enchiladas      5         food    0.5

In [43]:
# renaming a column... there a few ways

# (1) you can just assign to df.columns a list of names, and they'll *all* get changed

In [45]:
# (2) you can use df.rename, passing a dict whose keys are original column names
# and whose values are new column names. Pass this to the "columns" keyword argument

df.rename(columns={'tax':'sales_tax'})

        product  price   department  sales_tax
101       apple     10      produce        1.0
102      banana      5      produce        0.5
201    computer   1000  electronics      100.0
301    doorstop      2     hardware        0.2
401  enchiladas      5         food        0.5

In [47]:
# how do I drop a column?
# the "drop" method, which similarly takes a "columns" keyword argument

df.drop(columns=['tax'])

        product  price   department
101       apple     10      produce
102      banana      5      produce
201    computer   1000  electronics
301    doorstop      2     hardware
401  enchiladas      5         food

# Retrieving with `.loc` -- the 2-argument version

So far, we have used `.loc` to indicate what rows we want to get. But it turns out that there is a 2-argument version of `.loc`.

In all versions, the first argument is what I call the "row selector." You indicate what rows you want, and you get those rows. This can be a single index, or it can be a fancy index. (We're going to add to this later, with a boolean index.)

If you pass a second argument to `.loc`, that is what I call the "column selector." You can indicate what columns you want. This can be a single column name, or a list of column names.

In [49]:
# 2-column version of .lob

df.loc[
    101,            # row selector -- a single index
    'department'    # column selector -- a single column
    ]

'produce'

In [50]:
df.loc[
    [101, 301],   # row selector -- a fancy index
    'department'  # column selector -- a single column
    ]

101     produce
301    hardware
Name: department, dtype: object

In [51]:
df.loc[
    [101, 301],   # row selector -- a fancy index
    ['department', 'price']   # column selector -- 2 columns 
    ]

    department  price
101    produce     10
301   hardware      2

# Exercise: Family members

1. Create a data frame with 5 family members (or friends or make things up, if you don't have family/friends). Each row is one person. The columns will be named `name`, `age`, `shoesize`.
2. What is the mean `shoesize` for members of your family?
3. What are the `min` and `max` ages for members of your family?
4. Retrieve all of the names and their shoe sizes.
5. Retrieve the age and name for the person in row 0.

In [53]:
df = DataFrame([  ['Reuven', 55, 46],
                  ['SC', 53, 40],
                  ['AM', 25, 40],
                  ['SB', 23, 40],
                  ['AD', 20, 44]],
              columns='name age shoesize'.split())
df

     name  age  shoesize
0  Reuven   55        46
1      SC   53        40
2      AM   25        40
3      SB   23        40
4      AD   20        44

In [54]:
df['shoesize'].mean()

np.float64(42.0)

In [55]:
df['age'].min()

np.int64(20)

In [56]:
df['age'].max()

np.int64(55)

In [58]:
df['age'].describe()

count     5.000000
mean     35.200000
std      17.268468
min      20.000000
25%      23.000000
50%      25.000000
75%      53.000000
max      55.000000
Name: age, dtype: float64

In [59]:
# Retrieve all of the names and their shoe sizes.

df[['name', 'shoesize']]

     name  shoesize
0  Reuven        46
1      SC        40
2      AM        40
3      SB        40
4      AD        44

In [60]:
# Retrieve the age and name for the person in row 0.

df.loc[
    0,              # row selector
    ['name', 'age'] # column selector
    ]

name    Reuven
age         55
Name: 0, dtype: object

# Next up

1. Useful methods and attributes
2. Boolean/mask indexes

In [61]:
df

     name  age  shoesize
0  Reuven   55        46
1      SC   53        40
2      AM   25        40
3      SB   23        40
4      AD   20        44

# General rule of thumb

If a method exists for a Pandas series, then it almost certainly exists for a data frame, too.

In the case of the data frame, the method will be invoked on each column, and we'll get a result for each column.

In [62]:
# we've now seen that we can set an index when we create a data frame
# sometimes, we want to "promote" a regular column to be an index
# sometimes, we want to "demote" an index to be a regular column

# we can turn a column into the index with the set_index methods
df.set_index('name')  # this returns a new data frame with the "name" index -- it doesn't change the original

        age  shoesize
name
Reuven   55        46
SC       53        40
AM       25        40
SB       23        40
AD       20        44

In [63]:
# method chaining
# we open () on a line by themselves, and close them on a line by themselves
# Python's usually strict syntax melts away, since these are "on a single, long line"

(
    df                  
    .set_index('name')   # set the index to be name
    .loc[['SC', 'SB']]   # retrieve rows for two names
)

      age  shoesize
name
SC     53        40
SB     23        40

In [64]:
df

     name  age  shoesize
0  Reuven   55        46
1      SC   53        40
2      AM   25        40
3      SB   23        40
4      AD   20        44

In [67]:

(
    df                  
    .set_index('name')   # set the index to be name
    .loc[
        ['SC', 'SB'],  # retrieve two rows
        'age'          # get the "age" column
        ]
    .mean()            # get the mean of these two people's ages
)

np.float64(38.0)

In [68]:
# if you really want to set the index permanently, you can!
# just assign the result of set_index back to the data frame

df = df.set_index('name')
df

        age  shoesize
name
Reuven   55        46
SC       53        40
AM       25        40
SB       23        40
AD       20        44

In [70]:
# how can I undo this? I can say 

df.reset_index('name')  # this doesn't change df! But it does return a new data frame on which we can work

     name  age  shoesize
0  Reuven   55        46
1      SC   53        40
2      AM   25        40
3      SB   23        40
4      AD   20        44

In [71]:
# what about NaN?

df = DataFrame([  ['Reuven', 55, np.nan],
                  ['SC', 53, 40],
                  ['AM', 25, np.nan],
                  ['SB', np.nan, 40],
                  ['AD', np.nan, np.nan]],
              columns='name age shoesize'.split())
df

     name   age  shoesize
0  Reuven  55.0       NaN
1      SC  53.0      40.0
2      AM  25.0       NaN
3      SB   NaN      40.0
4      AD   NaN       NaN

In [72]:
# can I remove the NaNs? Yes, I can invoke df.dropna
# in a series, dropna returns a new series without any NaN values
# in a data frame, dropna returns a new data frame without any ROWS containing NaN values!

df.dropna()

  name   age  shoesize
1   SC  53.0      40.0

In [73]:
# one solution is to set the threshold for how many *good values* you need
# if you say thresh=2, then you must have at least 2 non-NaN values in a row to keep it

df.dropna(thresh=2)

     name   age  shoesize
0  Reuven  55.0       NaN
1      SC  53.0      40.0
2      AM  25.0       NaN
3      SB   NaN      40.0

In [74]:
# another solution is to set the "subset", meaning the column(s) where you cannot have NaN. Other columns, we don't care

df.dropna(subset='age')

     name   age  shoesize
0  Reuven  55.0       NaN
1      SC  53.0      40.0
2      AM  25.0       NaN

In [80]:
# of course, you can mix and match these

df.dropna(thresh=2, 
          subset=['name', 'age'])

     name   age  shoesize
0  Reuven  55.0       NaN
1      SC  53.0      40.0
2      AM  25.0       NaN

In [77]:
df.fillna(999)

     name    age  shoesize
0  Reuven   55.0     999.0
1      SC   53.0      40.0
2      AM   25.0     999.0
3      SB  999.0      40.0
4      AD  999.0     999.0

In [83]:
# another way: pass the mean

# remember: any series method can be run on a data frame, and we'll get one value back for each column

(
    df
    .set_index('name')
    .fillna( df.set_index('name').mean()  )
)

              age  shoesize
name
Reuven  55.000000      40.0
SC      53.000000      40.0
AM      25.000000      40.0
SB      44.333333      40.0
AD      44.333333      40.0